---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleView.IsSpare(System.Int32,System.Int32)
source: html/b1478b28-6960-c5f3-8b46-5467660ebf59.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView.IsSpare Method

Check if the circuit is a spare

## Syntax (C#)
```csharp
public bool IsSpare(
	int nRow,
	int nCol
)
```

## Parameters
- **nRow** (`System.Int32`) - Row Number
- **nCol** (`System.Int32`) - Column Number

## Returns
True if the circuit is a spare, false otherwise